%%e.g.1
clear all;
clc;
A=[0.78 -0.02 -0.12 -0.14;
    -0.02 0.86 -0.04 0.06;
    -0.12 -0.04 0.72 -0.08;
    -0.14 0.06 -0.08 0.74];
b=[0.76 0.08 1.12 0.68]';
x_0=[0 0 0 0]';
[x1,k1]=CGM(A,b,x_0);%%共轭
e1=norm(b-A*x1,inf);
[x2,k2]=GDM(A,b,x_0);%%最速
e2=norm(b-A*x2,inf);
%%e.g.2
clear all;
clc;
A=[2 1 -1;1 4 0;-1 0 2];
b=[1 -1 -2]';
A1=0.5.*A;
b1=-0.5.*b;
x_0=[0 0 0]';
% [x1,k1,P]=CGM1(A1,b1,x_0);%%共轭
% e1=norm(b1-A1*x1,inf);
[x2,k2,P]=CGM1(A,b,x_0);%%共轭
e1=norm(b-A*x2,inf);
[x3,k3]=GDM(A,b,x_0);%%最速
e2=norm(b-A*x3,inf);
%%e.g.3
clear all;
clc;
A=[10 1 2 3 4;
    1 9 -1 2 -3;
    2 -1 7 3 -5;
    3 2 3 12 -1;
    4 -3 -5 -1 15];
b=[12 -27 14 -17 12]';
x_0=[0 0 0 0 0]';
[x1,k1]=CGM(A,b,x_0);%%共轭
e1=norm(b-A*x1,inf);
[x2,k2]=GDM(A,b,x_0);%%最速
e2=norm(b-A*x2,inf);